adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="P0">
      <name>P1</name>
      <description>GPIO Port 1</description>
      <baseAddress>0x50000300</baseAddress>
      <alternatePeripheral>P0</alternatePeripheral>
    </peripheral>
    <peripheral>
      <name>OSCILLATORS</name>
      <description>Oscillator control</description>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OSCILLATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>ATECLOCK</name>
          <description>Analog test bus control for clock modules</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BYPASSHFXOSC</name>
          <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Enable or disable bypass of HFCLK crystal oscillator with external clock source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable (use with crystal or low-swing external source)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable (use with rail-to-rail external source)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PLL64M</name>
          <description>Unspecified</description>
          <headerStructName>OSCILLATORS_PLL64M</headerStructName>
          <access>read-write</access>
          <addressOffset>0x680</addressOffset>
          <register>
            <name>BYPASS</name>
            <description>PLL64M bypass control</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>BYPASS</name>
                <description>Enable or disable bypass of PLL64M by an external clock source</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MUTE</name>
            <description>Mute the PLL64M</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MUTE</name>
                <description>Mute output clock</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PROGCHPUMP</name>
            <description>Program charge pump current</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PROGCHPUMP</name>
                <description>Program charge pump current (only used for debugging)</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIM</name>
            <description>VCO trim value for the 64 MHz PLL</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIM</name>
                <description>VCO trim value for the 64 MHz PLL</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VCOTRIMOVERRIDE</name>
            <description>Control overriding of the VCO trim values</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VCOTRIMOVERRIDE</name>
                <description>VCO trim value for the 64 MHz PLL</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>VCO trim values are coming from FICR</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>VCO trim values are coming from the VCOTRIM register</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
