adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
          <register>
            <name>ULPCAL</name>
            <description>Calibration of ULP regulator</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Calibration value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEBUGLVLP</name>
            <description>Debug register - control spare signals in LVLP</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DEBUGLVLP</name>
                <description>Connected to TBD</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCALMAXILIM</name>
            <description>TBD</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALMAXILIM</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKCALPWM</name>
            <description>TBD</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CALPWM</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMEN</name>
            <description>PFM enable register</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>PFMEN</name>
                <description>Enable or disable PFM</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable PFM</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable PFM (default)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMCAL</name>
            <description>TBD</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMCAL</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMICMPCAL</name>
            <description>TBD</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMICMPCAL</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BUCKPFMICMPCOUNT</name>
            <description>TBD</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PFMICMPCOUNT</name>
                <description>TBD</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGTHRESHOLD</name>
            <description>Set threshold value of power regulator</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>PWRREGTHRESHOLD</name>
                <description>Sets the threshold value of power regulator</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AVOIDULP</name>
            <description>Backdoor to avoid ULP mode</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Backdoor to avoid ULP mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Default</name>
                    <description>FSM will enter ULP mode if no power requests are present.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AvoidUlp</name>
                    <description>Avoids ULP mode. By also setting disableDcdcDvdd=0 and disablePfmDvdd=0, PFM mode will be used as the lowest power regulator state.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>VREGMAIN</name>
          <description>Unspecified</description>
          <headerStructName>REGULATORS_VREGMAIN</headerStructName>
          <access>read-write</access>
          <addressOffset>0xA00</addressOffset>
          <register>
            <name>VOUT</name>
            <description>Control the output voltage</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>VOUT</name>
                <description>Output voltage</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPALWAYSON</name>
            <description>Keep ULP regulator on at all times</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>ULPALWAYSON</name>
                <description>ULP always on</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>ULP regulator turned off in LDO modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>ULP regulator always on</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENFORCEPWRREGMODE</name>
            <description>Enable forcing of power mode in power regulator</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ENFORCEPWRREGMODE</name>
                <description>Enable forcing of power mode in power regulator</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Power regulator forcing off</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Power regulator mode forced to value given by FORCEREGMODE</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEREGMODE</name>
            <description>Backdoor register for manual selection of power mode</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>FORCEREGMODE</name>
                <description>Force regulator mode to value</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>Force external</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>Force ULP mode</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>Force LDO mode</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>Force DC/DC mode</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>Force REF mode</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CURRENTPWRREGMODE</name>
            <description>Current mode in the power regulator</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>CURRENTPWRREGMODE</name>
                <description>Current mode in the power regulator</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ext</name>
                    <description>External</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC</name>
                    <description>DC/DC</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF</name>
                    <description>REF</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO</name>
                    <description>ULP DC/DC</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_DCDC</name>
                    <description>LDO DC/DC</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LDO_REF</name>
                    <description>LDO REF</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP</name>
                    <description>ULP</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCDC_ULP</name>
                    <description>ULP DC/DC</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>REF_ULP</name>
                    <description>REF ULP</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ULP_LDO</name>
                    <description>ULP DC/DC</description>
                    <value>0xC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PWRREGICMPTIMER</name>
            <description>Control the stay-alive time for the current comparator</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>COUNT</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TESTLOAD</name>
            <description>Test load setting</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>TESTLOAD</name>
                <description>Output load configuration for test purposes</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalOperation</name>
                    <description>Normal operation (default)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1mATestLoad</name>
                    <description>1 mA test load</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>20mATestLoad</name>
                    <description>20 mA test load</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPCAL</name>
            <description>Calibration of ULP regulator</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Calibration value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ULPICMPCAL</name>
            <description>Calibration of current comparator on ULP regulator</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BYPASS</name>
            <description>Bypass control</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CAL</name>
                <description>Bypass control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NormalMode</name>
                    <description>Normal operation (default)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BypassMode</name>
                    <description>Output voltage is 30 mV lower than input voltage</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DISABLEPACSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from PAC</description>
          <addressOffset>0xEE4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from PAC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLESRAMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from SRAM</description>
          <addressOffset>0xEE8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from SRAM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DISABLENVMSYSTEMOFFACK</name>
          <description>Enable or disable System OFF ack from NVM</description>
          <addressOffset>0xEEC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE</name>
              <description>Enable or disable System OFF ack from NVM</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable ack</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable ack</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
