adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
        <register>
          <name>DAI</name>
          <description>Device address match index</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DAI</name>
              <description>Device address match index</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PDUSTAT</name>
          <description>Payload status</description>
          <addressOffset>0x414</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PDUSTAT</name>
              <description>Status on payload length vs. PCNF1.MAXLEN</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LessThan</name>
                  <description>Payload less than PCNF1.MAXLEN</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GreaterThan</name>
                  <description>Payload greater than PCNF1.MAXLEN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_STAT</name>
          <description>DMA byte count</description>
          <addressOffset>0x418</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DMA_STAT</name>
              <description>Number of bytes in previous DMA transfer.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_CAL_VCO</name>
          <description>PLL Calibration</description>
          <addressOffset>0x420</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PLL_CAL_VCO</name>
              <description>Holds capacitance-setting for PLL after automatic setting has been performed. This value is updated at the end of the calibration interval.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LNB_OUT_SPI</name>
          <description>Readout of gain settings set by the AGC. They are sampled at EVENTS_ADDRESS and when triggering TASKS_RSSISTART</description>
          <addressOffset>0x424</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LNA_GAIN</name>
              <description>Readout of LNA gain setting. This is a function of received signal strength.</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>MIX_GAIN</name>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>AAF_GAIN</name>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CAL_OUT1</name>
          <description>Misc cal readouts</description>
          <addressOffset>0x430</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>AAFDCCALI</name>
              <description>High when AAF I channel offset is positive : compare signal for calibration</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AAFDCCALQ</name>
              <description>High when AAF Q channel offset is positive : compare signal for calibration</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CAL_OUT2</name>
          <description>Misc cal readouts</description>
          <addressOffset>0x434</addressOffset>
          <access>read-only</access>
          <resetValue>0x00002040</resetValue>
          <fields>
            <field>
              <name>RFMIXDCCALQSTATUS</name>
              <description>dc calibration of Q channel when aafCalOvrEn = 1</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RFMIXDCCALISTATUS</name>
              <description>dc calibration of I channel when aafCalOvrEn = 1</description>
              <lsb>7</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_STAT</name>
          <description>Carrier freq. offset estimate</description>
          <addressOffset>0x440</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Readout of last valid decision level set in BitSlicer (signed)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>LASTDEMODACTIVE</name>
              <description>0: Standard mode was used last 1: Hypermode was last used</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PHASE</name>
              <description>Readout of last valid phase set in correlator (hypermode only) (signed)</description>
              <lsb>16</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IQCAL_OUT</name>
          <description>Test: IandQ gain/phase mismatch calibration values out</description>
          <addressOffset>0x444</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CALPHIOUT</name>
              <description>readout of IandQ phase calibration value</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CALAMPOUT</name>
              <description>readout of IandQ gain calibration value</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>CALFIN</name>
              <description>calibration finished</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>CALOK</name>
              <description>calibration succeed</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>LASTDEMODACTIVE</name>
              <description>Mode last used</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>StandardMode</name>
                  <description>Standard mode last used</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HyperMode</name>
                  <description>Hyper mode last used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PBCAL_OUT</name>
          <description>Test: PB calibration values out</description>
          <addressOffset>0x448</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PBREADY</name>
              <description>PBIAS ready flag (bias outputs stable)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTESTATUS</name>
          <description>CTEInfo parsed from received packet</description>
          <addressOffset>0x44C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTETIME</name>
              <description>CTETime parsed from packet</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>RFU</name>
              <description>RFU parsed from packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTETYPE</name>
              <description>CTEType parsed from packet</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDCHECKSTAT</name>
          <description>Address Check Override</description>
          <addressOffset>0x450</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDUCHECK0</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for minimum latency.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>PDUCHECK1</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for medium latency.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>PDUCHECK2</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for maximum latency.</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>HAM</name>
              <description>Hamming distance between std demod AA15:0 and expected AA15:0.</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>SPAM</name>
              <description>Time distance #bit clock cycles from AAmatchHyp.</description>
              <lsb>21</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid flag bit</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDAADIFFVEC</name>
          <description>Address Diff Vector</description>
          <addressOffset>0x454</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Hyper AA15:0 and Std AA15:0 differs.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFESTATUS</name>
          <description>DFE status information</description>
          <addressOffset>0x458</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWITCHINGSTATE</name>
              <description>Internal state of switching state machine</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Switching state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offset</name>
                  <description>Switching state Offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Guard</name>
                  <description>Switching state Guard</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref</name>
                  <description>Switching state Ref</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Switching</name>
                  <description>Switching state Switching</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ending</name>
                  <description>Switching state Ending</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLINGSTATE</name>
              <description>Internal state of sampling state machine</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Sampling state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sampling</name>
                  <description>Sampling state Sampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETPTR</name>
          <description>Packet pointer</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>PACKETPTR</name>
              <description>Packet pointer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>Frequency</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Radio channel frequency</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>MAP</name>
              <description>Channel map selection.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Channel map between 2400 MHZ .. 2500 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Channel map between 2360 MHZ .. 2460 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOWER</name>
          <description>Output power</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>RADIO output power</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pos9dBm</name>
                  <description>+9 dBm</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos8dBm</name>
                  <description>+8 dBm</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos7dBm</name>
                  <description>+7 dBm</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos6dBm</name>
                  <description>+6 dBm</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos5dBm</name>
                  <description>+5 dBm</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4 dBm</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos3dBm</name>
                  <description>+3 dBm</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos2dBm</name>
                  <description>+2 dBm</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0 dBm</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4 dBm</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8 dBm</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12 dBm</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16 dBm</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20 dBm</description>
                  <value>0xEC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg30dBm</name>
                  <description>Deprecated enumerator -  -40 dBm</description>
                  <value>0xE2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg40dBm</name>
                  <description>-40 dBm</description>
                  <value>0xD8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBACKOFF</name>
              <description>Reduce output power by 0.5 dB relative to the setting in TXPOWER.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Output power will be as specified in TXPOWER.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Output power will equal TXPOWER - 0.5 dB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Data rate and modulation</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nrf_1Mbit</name>
                  <description>1 Mbps Nordic proprietary radio mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_2Mbit</name>
                  <description>2 Mbps Nordic proprietary radio mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_250Kbit</name>
                  <description>Deprecated enumerator -  250 kbps Nordic proprietary radio mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_1Mbit</name>
                  <description>1 Mbps BLE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_2Mbit</name>
                  <description>2 Mbps BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
