adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
        <register>
          <name>PCNF0</name>
          <description>Packet configuration register 0</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LFLEN</name>
              <description>Length on air of LENGTH field in number of bits.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>LENGTHINCL</name>
              <description>Include or exclude LENGTH field in RAM</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include LENGTH field in RAM only if LFLEN &amp;gt; 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0LEN</name>
              <description>Length on air of S0 field in number of bytes.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>S0INCL</name>
              <description>Include or exclude S0 field in RAM</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include S0 field only if S0LEN &amp;gt; 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S1LEN</name>
              <description>Length on air of S1 field in number of bits.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>S1INCL</name>
              <description>Include or exclude S1 field in RAM</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Automatic</name>
                  <description>Include S1 field in RAM only if S1LEN &amp;gt; 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>Always include S1 field in RAM independent of S1LEN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLEN</name>
              <description>Length of preamble on air. Decision point: TASKS_START task</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8-bit preamble</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16bit</name>
                  <description>16-bit preamble</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCINC</name>
              <description>Indicates if LENGTH field contains CRC or not</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Exclude</name>
                  <description>LENGTH does not contain CRC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Include</name>
                  <description>LENGTH includes CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF1</name>
          <description>Packet configuration register 1</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate the payload to MAXLEN.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STATLEN</name>
              <description>Static length in number of bytes</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BALEN</name>
              <description>Base address length in number of bytes</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Little</name>
                  <description>Least significant bit on air first</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Big</name>
                  <description>Most significant bit on air first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEEN</name>
              <description>Enable or disable packet whitening</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE0</name>
          <description>Base address 0</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE0</name>
              <description>Base address 0</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE1</name>
          <description>Base address 1</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BASE1</name>
              <description>Base address 1</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX0</name>
          <description>Prefixes bytes for logical addresses 0-3</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>AP0</name>
              <description>Address prefix 0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP1</name>
              <description>Address prefix 1.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP2</name>
              <description>Address prefix 2.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP3</name>
              <description>Address prefix 3.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX1</name>
          <description>Prefixes bytes for logical addresses 4-7</description>
          <addressOffset>0x528</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>AP4</name>
              <description>Address prefix 4.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AP5</name>
              <description>Address prefix 5.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>AP6</name>
              <description>Address prefix 6.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>AP7</name>
              <description>Address prefix 7.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXADDRESS</name>
          <description>Transmit address select</description>
          <addressOffset>0x52C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXADDRESS</name>
              <description>Transmit address select</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXADDRESSES</name>
          <description>Receive address select</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR0</name>
              <description>Enable or disable reception on logical address 0.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR1</name>
              <description>Enable or disable reception on logical address 1.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR2</name>
              <description>Enable or disable reception on logical address 2.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR3</name>
              <description>Enable or disable reception on logical address 3.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR4</name>
              <description>Enable or disable reception on logical address 4.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR5</name>
              <description>Enable or disable reception on logical address 5.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR6</name>
              <description>Enable or disable reception on logical address 6.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR7</name>
              <description>Enable or disable reception on logical address 7.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPER</name>
              <description>Hypermode settings</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Use hypermode for address ADDR0 (base address 0 RADIO.BASE0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B1</name>
                  <description>From all of the enabled addresses among ADDR1 through ADDR7, the address ADDRn with the highest index number 'n' will use hypermode (base address 1 RADIO.BASE1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCNF</name>
          <description>CRC configuration</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LEN</name>
              <description>CRC length in number of bytes.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CRC length is zero and CRC calculation is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>One</name>
                  <description>CRC length is one byte and CRC calculation is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Two</name>
                  <description>CRC length is two bytes and CRC calculation is enabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Three</name>
                  <description>CRC length is three bytes and CRC calculation is enabled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SKIPADDR</name>
              <description>Include or exclude packet address field out of CRC calculation.</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Include</name>
                  <description>CRC calculation includes address field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Skip</name>
                  <description>CRC calculation does not include address field. The CRC calculation will start at the first byte after the address.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPOLY</name>
          <description>CRC polynomial</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <description>CRC polynomial</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCINIT</name>
          <description>CRC initial value</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CRCINIT</name>
              <description>CRC initial value</description>
              <lsb>0</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x544</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x548</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI_CONFIG</name>
          <description>RSSI resolution</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSSICAL</name>
              <description>RSSI calibration value</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>if '1' enable override for this register</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x550</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the Disabled state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLED state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLED state</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
