adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <description>Data whitening initial value. Bit 6 is hardwired to '1', writing '0' to it has no effect, and it will always be read back and used by the device as '1'.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_MAXLEN</name>
          <description>DMA max length</description>
          <addressOffset>0x55C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000103</resetValue>
          <fields>
            <field>
              <name>DMA_MAXLEN</name>
              <description>Maximum size of DMA transfer in number of bytes</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BCC</name>
          <description>Bit counter compare</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BCC</name>
              <description>Bit counter compare</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AACHKOVERRIDE</name>
          <description>Address Check Override</description>
          <addressOffset>0x568</addressOffset>
          <access>read-write</access>
          <resetValue>0x02600000</resetValue>
          <fields>
            <field>
              <name>ENDCOUNTHYPSTD</name>
              <description>Defines maximum number of PDU bits to compare between Hyper and Std demodulator</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable AA bit 15 check</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AA16_31</name>
                  <description>Enable AA16..31</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA15_31</name>
                  <description>Enable AA15..31</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Bypass majority vote</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Majority vote</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>Bypass through majority vote</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable std AA checker</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable std AA checker</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable std AA checker</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOWADDRMATCHEARLY</name>
              <description>Enable ignore std AA checker before shift register filled</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERFECTADDRWINDOW</name>
              <description>Enable timing accurate address match window in demodulator</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The address window has some margin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The address window spans only one bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYMSBEFORESFD</name>
              <description>Number of preamble symbols before SFD to match, by default 2 symbols.</description>
              <lsb>24</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>ENCONCRX</name>
              <description>Enable concurrent RX AA match mechanism</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BleLR</name>
                  <description>AA match to primary advertising packets on BLE LR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Concurrent</name>
                  <description>Concurrent AA match to primary advertising packets on both BLE LR (hyper) and BLE 1M (standard), the winner takes over the packet parser</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble1Mbit</name>
                  <description>AA match to primary advertising packets on BLE 1M only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DoNotUse</name>
                  <description>Illegal combination</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_TEST</name>
          <description>Test: PB calibration</description>
          <addressOffset>0x56C</addressOffset>
          <access>read-write</access>
          <resetValue>0xC0000880</resetValue>
          <fields>
            <field>
              <name>PBIBPSTRIM</name>
              <description>Trim code for IBPS currents</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VBGTRIM</name>
              <description>Trim code for VBG to FS_VCOREG</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENPBIBPSTRIM</name>
              <description>if '1' enable override for PBIBPSTRIM</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENVBGTRIM</name>
              <description>if '1' enable override for VBGTRIM</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_CNTR1</name>
          <description>Test: PER msrmnts</description>
          <addressOffset>0x570</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>Packet counter value</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_CNTR2</name>
          <description>Test: PER msrmnts</description>
          <addressOffset>0x574</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>HYPER</name>
              <description>Number of detected correlator syncs</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NORMAL</name>
              <description>Packet counter value (number of packets with addressmatch ok)</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IQCAL_TEST</name>
          <description>Test: IandQ gain/phase mismatch calibration control</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <fields>
            <field>
              <name>RUN</name>
              <description>Run IanQ calibration procedure</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>IQCal search mode</description>
              <lsb>1</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IQCALWAIT</name>
              <description>Settling time (in number of 16 MHz clock periods) for rssi input to stabilize</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBC_COEFFS</name>
          <description>Test and Debug: DBC coefficients override</description>
          <addressOffset>0x580</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PADDRUPDATEOVREN</name>
              <description>paddrUpdateOvrEn</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>PADDRUPDATEOVRVAL</name>
              <description>paddrUpdateOvrVal</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRALWAYSUPDATE</name>
              <description>Zero means coefficients only updated when needed (default), set to 1 coefficients are always updated when the radio is enabled.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_CONFIG</name>
          <description>Fs config (ana+dig)</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <resetValue>0x00091B08</resetValue>
          <fields>
            <field>
              <name>SSEL</name>
              <description>Deprecated field -  Sideband select (1=upper/0=lower)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FSPFDCPREG</name>
              <description>Value used for RADIO-&amp;gt;FS_CONFIG.VCOVDD when RADIO-&amp;gt;FS_CONFIG.OVRVCOVDD = 0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Use power filter on PFD and charge pump in radio</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Use LDO and PFD and charge pump in radio</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSPDCKDISABLE</name>
              <description>Shut off FS_PD by clamping the clocks</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>FSPDDLY</name>
              <description>configuration register: Phase detector delay</description>
              <lsb>3</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>FSVCOSHUTUP</name>
              <description>fsVcoShutup</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>FSVCOCURR</name>
              <description>Analog configuration register: VCO current</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>FSPDCURR</name>
              <description>Analog configuration register: Phase detector current</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>FSGFSKBT</name>
              <description>Adjust GFSK bandwidth. '1': 0.6, '0': 0.55</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>FSGFSKBYPASS</name>
              <description>'1': Unfiltered FSK transmission</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>FSMODULATORDELAY</name>
              <description>programmable delay</description>
              <lsb>18</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>FSVCOKMODOVRD</name>
              <description>Override modulator gain distribution (between analog/digital)</description>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>FSVCOCAPOVRD</name>
              <description>Override value for external control of VCO calibration, 0x00 for off</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRVCOVDD</name>
              <description>Use 1v3 supply for FS_VCO power</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ficr</name>
                  <description>Value of FICR.RADIOTRIM01-&amp;gt;FSPFDCPREG is used in stead of FS_CONFIG.VCOVDD</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Par</name>
                  <description>Use FS_CONFIG.VCOVDD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRENFSGFSKBYPASS</name>
              <description>if '1' enable override for FSGFSKBYPASS</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENFSMODULATORDELAY</name>
              <description>if '1' enable override for FSMODULATORDELAY</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_TEST</name>
          <description>Fs misc test</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00004008</resetValue>
          <fields>
            <field>
              <name>FSDEVCHANNELGRADIENT</name>
              <description>FS deviation scale factor gradient over channel no</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>FSTESTTXDITHEROFF</name>
              <description>1: Shutoff dither in TxSDM</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>FSTESTFSDITHEROFF</name>
              <description>1: Shutoff dither in FsSDM</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>FSTESTUSE2NDSDM</name>
              <description>1: Switch to single loop SDM in FsSDM</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>FSTESTMODULATOR</name>
              <description>1: Disables TX path during LO modulation test. 0: Normal mode</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>FSTXMODULATORGAIN</name>
              <description>Adjust TX path modulation gain</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>FSDEVOVERRIDE</name>
              <description>External control of frequency deviation, value overrides calculated FS and TX multipliers, 0x00 for off</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>LOIFOVERRIDEON</name>
              <description>1 : LO IF override is on. 0 : LO IF override is off</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>LOIFOVERRIDESIDEBAND</name>
              <description>1 : Upper sideband of LO. 0 : Lower sideband of LO</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>LOIFOVERRIDEFREQUENCY</name>
              <description>0 : 1 MHz. 1 : 2 MHz</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>FSTXSDMALWAYSON</name>
              <description>0 : TxSDM on only in TX mode. 1 : TxSDM on in both TX and RX mode</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>OVRENFSTXMODULATORGAIN</name>
              <description>if '1' enable override for FSTXMODULATORGAIN</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENFSDEVOVERRIDE</name>
              <description>if '1' enable override for FSDEVOVERRIDE</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FS_TRIM</name>
          <description>Fs misc trim</description>
          <addressOffset>0x58C</addressOffset>
          <access>read-write</access>
          <resetValue>0x82000115</resetValue>
          <fields>
            <field>
              <name>FSDIVTUNE</name>
              <description>Trim value for DIV2_4</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>CTRIM</name>
              <description>Trim value for C in loop filter</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RTRIM</name>
              <description>Trim value for R in loop filter</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>FSTXSDMCKSELECT</name>
              <description>fsTxSdmCkSelect. 0: ck64MFs, 1: ck32M</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>FSTESTTXSDMSHUTOFF</name>
              <description>fsTestTxSdmShutoff. 1: Shutoff TxSDM, e.g. for testing RX phase noise, highest priority</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>FSTESTFSSDMSHUTOFF</name>
              <description>fsTestFsSdmShutoff. 1: Shutoff FsSDM, highest priority</description>
              <lsb>14</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>FSFINETUNE</name>
              <description>RF frequency adjustment (signed), LSB corresponds to 2 kHz, i.e. a range of +/-256 kHz</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>FSPDCURRALT</name>
              <description>Internal register to set FSPDCURR differently for some channels if FICR FSPDCURROPT is set to 1</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>OVRENFSDIVTUNE</name>
              <description>if '1' enable override for FSDIVTUNE</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_TRIM1</name>
          <description>Misc Aaf/ADC trim related</description>
          <addressOffset>0x590</addressOffset>
          <access>read-write</access>
          <resetValue>0x7E130050</resetValue>
          <fields>
            <field>
              <name>AAFRCTRIM</name>
              <description>Process compensation for R and C</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LNACFREQ</name>
              <description>Change centre frequency of LNA LC tank</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>RADIOCKHIGHDRV</name>
              <description>Enable high drive on RADIO_CK module</description>
              <lsb>19</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>LNACFREQAUTOEN</name>
              <description>LNACFREQ automatically set based on selected channel</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>AAFRCCALTSETTLE</name>
              <description>Deprecated field -  Sets number of clock pulses in the SETTLE state (calEngineTsettle)</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRENAAFRCTRIM</name>
              <description>if '1' enable override for AAFRCTRIM</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENLNACFREQ</name>
              <description>if '1' enable override for LNACFREQ</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
