adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
        <register>
          <name>QOVERRIDE2</name>
          <description>Trim value override register 2 for nRF52</description>
          <addressOffset>0x72C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000A000</resetValue>
          <fields>
            <field>
              <name>TIFSDELTA</name>
              <description>Override for tIfsDelta</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPLLSETTLED</name>
              <description>Override for tPllSettled</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>if '1' enable override for TIFSDELTA</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE3</name>
          <description>Trim value override register 3 for nRF52</description>
          <addressOffset>0x730</addressOffset>
          <access>read-write</access>
          <resetValue>0x81008400</resetValue>
          <fields>
            <field>
              <name>TRXAGCEN</name>
              <description>Override for tRxAgcEn</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TRXDIGEN</name>
              <description>Override for tRxDigEn</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE4</name>
          <description>Trim value override register 4 for nRF52</description>
          <addressOffset>0x734</addressOffset>
          <access>read-write</access>
          <resetValue>0x0014205A</resetValue>
          <fields>
            <field>
              <name>BSBITLENGTHTOLERANSE</name>
              <description>Override for bsBitLengthToleranse</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>BSDISABLEPREAMBLEBLOCK</name>
              <description>Override for bsDisablePreambleBlock</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BSENABLETHRESHOLDADJUST</name>
              <description>Override for bsEnableThresholdAdjust</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>BSDATAPEAK2PEAK</name>
              <description>Override for bsDataPeak2Peak</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>BSSTROBEDATAIN</name>
              <description>Override for bsStrobeDataIn</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>BSSTROBEDELAY</name>
              <description>Override for bsStrobeDelay</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>BSYLEVALG</name>
              <description>Override for bsYlevAlg</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREAMBFILTTH</name>
              <description>Threshold for the preamble filter</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>ENPREAMBFILT</name>
              <description>Enable preamble filter</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable override of default trim values</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE5</name>
          <description>Trim value override register 5 for nRF52</description>
          <addressOffset>0x738</addressOffset>
          <access>read-write</access>
          <resetValue>0x00060020</resetValue>
          <fields>
            <field>
              <name>PREAMBFILTCYCLES</name>
              <description>Override value for preambFiltCycles</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTH</name>
              <description>Override value for bitSlicerSwingTh</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREAMBFILTMINSTRLEN</name>
              <description>Override value for preambFiltMinStrLen</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE6</name>
          <description>Trim value override register 6 for nRF52</description>
          <addressOffset>0x73C</addressOffset>
          <access>read-write</access>
          <resetValue>0x40003090</resetValue>
          <fields>
            <field>
              <name>DBCCORRTH</name>
              <description>Override value for correlation Threshold</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DBCENABLESRC</name>
              <description>Override value for dbcEnableSrc</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AlwaysOn</name>
                  <description>Always on when not address match</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBLogMag</name>
                  <description>When bbLogMag is above a threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BitSlicerSwing</name>
                  <description>When a certain time has gone since the input to the bitslicer was above BITSLICERSWINGTH</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Both BBLogMag and BitSlicerSwing</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFBSTRBOFFSET</name>
              <description>Override value for strobe offset</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>DBCTIMEOUT</name>
              <description>Override value for correlator timeout,in bit periods (hypermode)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DBCENABLETH</name>
              <description>Override value for correlator enable threshold</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>ENCHECKMULTIPEAKS</name>
              <description>Enable checking of several correlator peaks in hypermode</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>DBCCORRTHEN</name>
              <description>Override value enable for DBCCORRTH and MFBSTRBOFFSET</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE7</name>
          <description>Trim value override register 7 for nRF52</description>
          <addressOffset>0x740</addressOffset>
          <access>read-write</access>
          <resetValue>0x00281F20</resetValue>
          <fields>
            <field>
              <name>DRIFTALPHA</name>
              <description>Override value for IIR feedback , drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DBCADDRTIMEOUT</name>
              <description>Override value for address match timeout, [in bit periods] (hypermode)</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DRIFTVALIDTH</name>
              <description>Override value for driftValidTh, drift estimator (hypermode)</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>DISABLEFRAMESYNCLRTIMEOUT</name>
              <description>Disable framesync timeout (early address match timeout) for BLE LR mode. No override-enable to set for this (hypermode)</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Override enable for DRIFTALPHA, DBCADDRTIMEOUT and DRIFTVALIDTH</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE8</name>
          <description>Trim value override register 8 for nRF52</description>
          <addressOffset>0x744</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C8A0008</resetValue>
          <fields>
            <field>
              <name>DRIFTLOWTH</name>
              <description>Override value for driftLowTh, drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>DRIFTMAXDIST</name>
              <description>Override value for driftMaxDist, drift estimator (hypermode)</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>DRIFTDELAYTH</name>
              <description>Override value for driftDelayTh, drift estimator (hypermode)</description>
              <lsb>20</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Override value enable for override register 8</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE9</name>
          <description>Trim value override register 9 for nRF52</description>
          <addressOffset>0x748</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>PSDDEMODDELAY</name>
              <description>Override value for psdDemodDelay (standard mode)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DEMODINVERT</name>
              <description>Override value for demodInvert (standard and hyper)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTIME</name>
              <description>Bit slicer swing time</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MODINDEXOVREN</name>
              <description>modIndexOvrEn</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>MODINDEXOVRVAL</name>
              <description>modIndexOvrVal</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>SCALERDECAYDELAY</name>
              <description>Decay delay for the IQ scaler</description>
              <lsb>20</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE10</name>
          <description>Trim value override register 10 for nRF52</description>
          <addressOffset>0x74C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <fields>
            <field>
              <name>AGCWAIT</name>
              <description>Override value for agcWait</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>AGCRFPKDETRESETCOUNT</name>
              <description>Override value for agcRFpkDetResetCount</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>AGCWAITPACKET</name>
              <description>Override value for agcWaitPacket</description>
              <lsb>12</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>AGCFREEZEGAINENABLE</name>
              <description>Override AGC gain setting during CTE</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Adjust</name>
                  <description>AGC gain settings will keep adjusting during CTE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Freeze</name>
                  <description>AGC gain settings will freeze (not keep adjusting) during CTE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCFREEZEAFTERREF</name>
              <description>Modifier bit for AGCFREEZEGAINENABLE</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EntireCTE</name>
                  <description>Gain freeze will apply to whole CTE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AfterRefPeriod</name>
                  <description>Gain freeze will apply only after the reference period of the CTE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCENABLEGAINSWITCH</name>
              <description>Override value for agcEnableGainSwitch</description>
              <lsb>20</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>AGCRFGAINMAX</name>
              <description>Override value for agcRFGainMax</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>AGCRFGAINMIN</name>
              <description>Override value for agcRFGainMin</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE11</name>
          <description>Trim value override register 11 for nRF52</description>
          <addressOffset>0x750</addressOffset>
          <access>read-write</access>
          <resetValue>0x05090511</resetValue>
          <fields>
            <field>
              <name>AGCRFGAINSTEPUP</name>
              <description>Override value for agcRFgainStepUp</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>AGCRFGAINSTEPDOWN</name>
              <description>Override value for agcRFgainStepDown</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>AGCIFGAINMAX</name>
              <description>Override value for agcIFgainMax</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>AGCIFGAINMIN</name>
              <description>Override value for agcIFgainMin</description>
              <lsb>11</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>AGGIFGAINSTEPUP</name>
              <description>Override value for aggIFgainStepUp</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>AGGIFGAINSTEPDOWN</name>
              <description>Override value for aggIFgainStepDown</description>
              <lsb>19</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>ALPHA</name>
              <description>used in Rssi moving exponential averager</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE12</name>
          <description>Trim value override register 12 for nRF52</description>
          <addressOffset>0x754</addressOffset>
          <access>read-write</access>
          <resetValue>0x01F4044C</resetValue>
          <fields>
            <field>
              <name>IFPKDETHIGHTHRES</name>
              <description>Override value for IfpkDetHighThres</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SATDELAYCORRECTION</name>
              <description>Signed correction value for how much the saturation information is delayed from the input ADC samples to the samples being stored to RAM in direction finding operation</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>IFPKDETLOWTHRES</name>
              <description>Override value for IfpkDetLowThres</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE13</name>
          <description>Trim value override register 13 for nRF52</description>
          <addressOffset>0x758</addressOffset>
          <access>read-write</access>
          <resetValue>0x0025005D</resetValue>
          <fields>
            <field>
              <name>BBPKDETHIGHTHRES</name>
              <description>Override value for BbpkDetHighThres</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>BBPKDETLOWTHRES</name>
              <description>Override value for BbpkDetLowThres</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE14</name>
          <description>Trim value override register 14 for nRF52</description>
          <addressOffset>0x75C</addressOffset>
          <access>read-write</access>
          <resetValue>0x02100304</resetValue>
          <fields>
            <field>
              <name>IFPKDETDECAYSTEP</name>
              <description>Override value for IfpkDetDecayStep</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>BBPKDETDECAYSTEP</name>
              <description>Override value for BbpkDetDecayStep</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>CALPHI</name>
              <description>Override value for calphi (programmable IandQ phase mismatch correction)</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>CALAMP</name>
              <description>Override value for calamp (programmable IandQ gain mismatch correction)</description>
              <lsb>21</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OVRENCALPHICALAMP</name>
              <description>if '1' enable override for CALPHI/CALAMP</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE15</name>
          <description>Trim value override register 15 for nRF52</description>
          <addressOffset>0x760</addressOffset>
          <access>read-write</access>
          <resetValue>0x66642120</resetValue>
          <fields>
            <field>
              <name>TARSTFS</name>
              <description>Override value for tArstFs</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TFSSTART</name>
              <description>Override value for tFsStart</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPWRUPADC</name>
              <description>Override value for tPwrupAdc</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TCALSTART</name>
              <description>Override value for tCalStart</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE16</name>
          <description>Trim value override register 16 for nRF52</description>
          <addressOffset>0x764</addressOffset>
          <access>read-write</access>
          <resetValue>0x78646464</resetValue>
          <fields>
            <field>
              <name>TPWRUPAAF</name>
              <description>Override value for tPwrupAaf</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPWRUPMIX</name>
              <description>Override value for tPwrupMix</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TPWRUPLNA</name>
              <description>Override value for tPwrupLna</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPWRUPPKD</name>
              <description>Override value for tPwrupPkd</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
