adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.svd
        <register>
          <name>QOVERRIDE17</name>
          <description>Trim value override register 17 for nRF52</description>
          <addressOffset>0x768</addressOffset>
          <access>read-write</access>
          <resetValue>0x006C6366</resetValue>
          <fields>
            <field>
              <name>TRFMIXEN</name>
              <description>Override value for tRfMixEn</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TARSTADC</name>
              <description>Override value for tArstAdc</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TARSTADCEND</name>
              <description>Override value for tArstAdcEnd</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TPWRUPTXDAC</name>
              <description>Override value for tPwrupTxDac</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE18</name>
          <description>Trim value override register 18 for nRF52</description>
          <addressOffset>0x76C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OVRENFSCKEN</name>
              <description>Override enable: ovrEnFsCkEn</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRENADCCKEN</name>
              <description>Override enable: ovrEnAdcCkEn</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OVRENRXDIGEN</name>
              <description>Override enable: ovrEnRxDigEn</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OVRENARSTFS</name>
              <description>Override enable: ovrEnArstFs</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENFSSTART</name>
              <description>Override enable: ovrEnFsStart</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>OVRENPWRUPFS</name>
              <description>Override enable: ovrEnPwrupFs</description>
              <lsb>13</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OVRENPWRUPPBIAS</name>
              <description>Override enable: ovrEnPwrupPbias</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OVRENPWRUPADC</name>
              <description>Override enable: ovrEnPwrupAdc</description>
              <lsb>16</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>OVRENPWRUPAAF</name>
              <description>Override enable: ovrEnPwrupAaf</description>
              <lsb>18</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>OVRENPWRUPMIX</name>
              <description>Override enable: ovrEnPwrupMix</description>
              <lsb>20</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OVRENPWRUPLNA</name>
              <description>Override enable: ovrEnPwrupLna</description>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OVRENPWRUPPKD</name>
              <description>Override enable: ovrEnPwrupPkd</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OVRENRFMIXEN</name>
              <description>Override enable: ovrEnRfMixEn</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OVRENARSTADC</name>
              <description>Override enable: ovrEnArstAdc</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OVRENPWRUPTX</name>
              <description>Override enable: ovrEnPwrupTx</description>
              <lsb>27</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRENPWRUPTXPA</name>
              <description>Override enable: ovrEnPwrupTxPa</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRENPWRUPTXDAC</name>
              <description>Override enable: ovrEnPwrupTxDac</description>
              <lsb>30</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE19</name>
          <description>Trim value override register 19 for nRF52</description>
          <addressOffset>0x770</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000150</resetValue>
          <fields>
            <field>
              <name>TREDUCETRXSWITCH</name>
              <description>Override value: tReduceTrxSwitch</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>OVRVALFSCKEN</name>
              <description>Override value: ovrValFsCkEn</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRVALADCCKEN</name>
              <description>Override value: ovrValAdcCkEn</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OVRVALRXDIGEN</name>
              <description>Override value:  ovrValRxDigEn</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>OVRVALARSTFS</name>
              <description>Override value: ovrValArstFs</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRVALFSSTART</name>
              <description>Override value: ovrValFsStart</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>OVRVALPWRUPFS</name>
              <description>Override value: ovrValPwrupFs</description>
              <lsb>13</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>OVRVALPWRUPPBIAS</name>
              <description>Override value: ovrValPwrupPbias</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>OVRVLPWRUPADC</name>
              <description>Override value: ovrVlPwrupAdc</description>
              <lsb>16</lsb>
              <msb>17</msb>
            </field>
            <field>
              <name>OVRVALPWRUPAAF</name>
              <description>Override value: ovrValPwrupAaf</description>
              <lsb>18</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>OVRVALPWRUPMIX</name>
              <description>Override value: ovrValPwrupMix</description>
              <lsb>20</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>OVRVALPWRUPLNA</name>
              <description>Override value: ovrValPwrupLna</description>
              <lsb>22</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>OVRVALPWRUPPKD</name>
              <description>Override value: ovrValPwrupPkd</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OVRVALRFMIXEN</name>
              <description>Override value: ovrValRfMixEn</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OVRVALARSTADC</name>
              <description>Override value: ovrValArstAdc</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OVRVALPWRUPTX</name>
              <description>Override value: ovrValPwrupTx</description>
              <lsb>27</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRVALPWRUPTXPA</name>
              <description>Override value: ovrValPwrupTxPa</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRVALPWRUPTXDAC</name>
              <description>Override value: ovrValPwrupTxDac</description>
              <lsb>30</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE20</name>
          <description>Trim value override register 20 for nRF52</description>
          <addressOffset>0x774</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEMOD</name>
              <description>Demodulator mode override value. 1=hyper,0=standard</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>Hypermode disabled (override value)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hyper</name>
                  <description>Hypermode enabled (override value)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAFFREQ</name>
              <description>IF frequency, 0=1MHz (for &amp;lt; =1Mbps), 1=2MHz (for 2Mbps)</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>AAFENSTAGE</name>
              <description>Enable extra AAF filter stage</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OVRENDEMOD</name>
              <description>if '1' enable override for DEMOD</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>OVRENAAFFREQ</name>
              <description>if '1' enable override for AAFFREQ</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>OVRENAAFENSTAGE</name>
              <description>if '1' enable override for AAFENSTAGE</description>
              <lsb>26</lsb>
              <msb>26</msb>
            </field>
            <field>
              <name>OVRENLNACURR</name>
              <description>if '1' enable override for LNACURR</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE21</name>
          <description>Trim value override register 21 for nRF52</description>
          <addressOffset>0x778</addressOffset>
          <access>read-write</access>
          <resetValue>0x50000000</resetValue>
          <fields>
            <field>
              <name>TDELTAPWRDNPA</name>
              <description>Override for tDeltaPwrdnPa (full resolution)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TDELTAPIPE</name>
              <description>Override for tDeltaPipe (full resolution)</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TDELTATXSEND</name>
              <description>Override for tDeltaTxSend (full resolution)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TDELTAOVREN</name>
              <description>Override enable</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>TXPASRAMP0V9</name>
              <description>Debug: Control of PA RAMP time, Up/ down</description>
              <lsb>26</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>TXRXTURNAROUNDDELTA</name>
              <description>Tuning of radio turn around timing</description>
              <lsb>28</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable override of default trim values</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE22</name>
          <description>Trim value override register 22 for nRF52</description>
          <addressOffset>0x77C</addressOffset>
          <access>read-write</access>
          <resetValue>0x62040122</resetValue>
          <fields>
            <field>
              <name>DSSSPEAKDISTTOL</name>
              <description>Override for dsssPeakDistanceTolerance</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>DSSSMINPEAKCOUNT</name>
              <description>Override for dsssMinPeakCount</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DISABLEHYPERANT</name>
              <description>Disable or enable hypermode fix for ANT</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLEADDRWINDOW</name>
              <description>Disable or enable the qualification of addressMatch vs. detect</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRXTXASYM1M2MHOLD</name>
              <description>TIFS negative offset when the mode is switched from 1M to 2M</description>
              <lsb>11</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>TRXTXTURNAROUNDHOLD</name>
              <description>Additional delay to hold Tx/Rx turnaround, full resolution [250ns]</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>TRXTXASYM2M1MHOLD</name>
              <description>TIFS positive offset when the mode is switched from 2M to 1M</description>
              <lsb>26</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable override for DSSSPEAKDISTTOL and DSSSMINPEAKCOUNT</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE23</name>
          <description>Trim value override register 23 for nRF52</description>
          <addressOffset>0x780</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002848</resetValue>
          <fields>
            <field>
              <name>ENDSSSCFOAVE</name>
              <description>Enable CFO averaging</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ENDSSSSTAVE</name>
              <description>Enable strobe time averaging</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ENMAYBESIDELOBE</name>
              <description>Ignore peaks from DBC which look like sidelobes</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ENADUALDISTANCE</name>
              <description>Allow dual distance between peaks</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DRIFTSATENABLEALWAYS</name>
              <description>Enable saturation in drift calculator for all modes</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>OVRENCNRIPPLEWARNCFG</name>
              <description>Override enable for CNPEAKMINTHR and CNABSMAXTHR in the CNRIPPLEWARNCFG register</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>ENABLEFEEDBACK</name>
              <description>Enable decision feedback for matched filter bank</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>HIGHERTHANMARGINDBC</name>
              <description>Required peak height required for a double correlator peak to be considered higher than previous ones. The register value will be multiplied by 25 to obtain the actual margin. The bitfield is NOT subject to the enable override at bit position 31, and will always be enabled for hypermode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>KEEPSTDINDSSS</name>
              <description>Keep standard demod in DSSS mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable override for OVERRIDE23 (except HIGHERTHANMARGINDBC and OVRENCNRIPPLEWARNCFG)</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE25</name>
          <description>Unspecified</description>
          <addressOffset>0x788</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBCCORRTHSTRICT</name>
              <description>Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DBCCORRTHPREVREQUIR</name>
              <description>Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MINPEAKCOUNTSTRICT</name>
              <description>Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx.</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>DBCPEAKDETSEL</name>
              <description>DBC peak detector selection</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>Use classic peak detector (backward compatible behavior)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Differential</name>
                  <description>Use differential peak detector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRENDBCCORRTHSTRICT</name>
              <description>Override enable for DBCCORRTHSTRICT</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRENDBCCORRTHPREVREQUIR</name>
              <description>Override enable for DBCCORRTHPREVREQUIR</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRENMINPEAKCOUNTSTRICT</name>
              <description>Override enable for MINPEAKCOUNTSTRICT</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCPEAKDETTHR</name>
          <description>Thresholds for each peak detector instance</description>
          <addressOffset>0x78C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>THR0</name>
              <description>Diff threshold 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>THR1</name>
              <description>Diff threshold 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>THR2</name>
              <description>Diff threshold 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>THR3</name>
              <description>Diff threshold 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
